Tekla Open API Reference for Tekla Structures 2025
Localization.LoadAilFile Method
 Loads the localization strings from an ail file. Several files may be used concurrently, just call LoadAilFile for each file. The translations are searched in the loading order and the first match is returned.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void LoadAilFile(
	string fileName
)
Public Sub LoadAilFile (
	fileName As String
)
Parameters
fileName
Type: System.String
The ail file to be loaded.
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace